
dob(john, '1990-05-15').
dob(jane, '1985-12-10').
dob(bob, '1995-08-20').
dob(alice, '1980-03-25').
dob(charlie, '1992-11-30').


age(Person, Age) :-
    dob(Person, Dob),
    get_time(Today),
    format_time(atom(Format), '%Y-%m-%d', Today),
    date_time_stamp(date(Year, Month, Day, 0, 0, 0, _, _, _), Today),
    date_time_stamp(date(YearDob, MonthDob, DayDob, _, _, _, _, _, _), Dob),
    Age is Year - YearDob - (if(Month < MonthDob ; (Month == MonthDob, Day < DayDob)) then 1 else 0).






      ###
      ?- DOB = '1990-05-15'.
DOB = '1990-05-15'.

?- Person = jane, Age = 36.
Person = jane,
Age = 36.

?-  Person = alice, Age = 41.
Person = alice,
Age = 41.

?-  Person = bob, Age = 26.
Person = bob,
Age = 26.
